app/controllers/answers_controller.rb

SELECT * FROM "polls" WHERE ("polls"."id" = 9)
SELECT * FROM "answers" WHERE ("answers".question_id = 48)
SELECT * FROM "groups" WHERE ("groups".poll_id = 6) AND ("groups".poll_id = 6) ORDER BY position ASC
SELECT * FROM "questions" WHERE ("questions".group_id = 11) AND ("questions".group_id = 11) ORDER BY position ASC
---
  def show
    @poll = Poll.find(params[:id])
    @answer_count = @poll.groups[0].questions[0].answers.length

SELECT * FROM "polls" WHERE ("polls"."id" = 12)
SELECT * FROM "answers" WHERE ("answers".question_id = 59)
SELECT * FROM "groups" WHERE ("groups".poll_id = 12) AND ("groups".poll_id = 12) ORDER BY position ASC
SELECT * FROM "questions" WHERE ("questions".group_id = 21) AND ("questions".group_id = 21) ORDER BY position ASC
---
  def tabular
    # display answers in tabular format
    @poll = Poll.find(params[:id])
    @answer_count = @poll.groups[0].questions[0].answers.length

INSERT INTO "answers" ("updated_at", "question_id", "responder_id", "answer_text", "created_at") VALUES('2009-09-28 13:44:28', 6, NULL, NULL, '2009-09-28 13:44:28')
SELECT * FROM "polls" WHERE ("polls"."id" = 1)
---
  def create
    responder_id = params[:responder_id] || rand.to_s[2,15]
    for ans in params[:answer].keys.select {|k|  k =~ /^answer_to_question_/}
      Answer.create(:responder_id=>responder_id, :question_id=>ans[-2,2].to_i,
        :answer_text=>params['answer'][ans])
    end

    flash[:notice] = 'Answers were successfully created.'
    redirect_to(Poll.find(params['answer']['poll_id']))