app/controllers/polls_controller.rb

SELECT * FROM "polls"
---
  def index
    @polls = Poll.all

SELECT * FROM "polls" WHERE ("polls"."id" = 2)
---
  def show
    @poll = Poll.find(params[:id])

SELECT * FROM "groups" WHERE ("groups"."poll_id" IS NULL) LIMIT 1
---
  def new
    @poll = Poll.new
    @poll.groups.build(:poll_id=>@poll.id)

SELECT * FROM "polls" WHERE ("polls"."id" = 1)
---
  def edit
    @poll = Poll.find(params[:id])

INSERT INTO "polls" ("name", "updated_at", "user_id", "created_at") VALUES('first', '2009-07-31 23:44:04', 1, '2009-07-31 23:44:04')
---
  def create
    modified_params = ensure_position_assigned(params)
    @poll = Poll.new(modified_params)
    @poll.user = current_user
    respond_to do |format|
      if @poll.save

SELECT * FROM "polls" WHERE ("polls"."id" = 10)
---
  def update
    @poll = Poll.find(params[:id])

SELECT * FROM "polls" WHERE ("polls"."id" = 5)
DELETE FROM "polls" WHERE "id" = 5
---
  def destroy
    @poll = Poll.find(params[:id])
    session[:poll_id] = nil
    @poll.destroy