app/controllers/users_controller.rb

SELECT * FROM "users" LIMIT 1
---
  def index
    @users = User.all

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def show
    if current_user.id == params[:id]
      @user = User.find(params[:id])

INSERT INTO "users" ("updated_at", "crypted_password", "username", "password_salt", "persistence_token", "email", "created_at") VALUES('2009-07-30 23:46:53', 'c692fdb498478f19b98aeac56aeeca8d8638ddfc3fe0d6250fd037be0e6158162c333903f28507a49191303561930748635ea15ca29d2b415eef203b04eb8459', 'dan', 'Bx8VIPu-PWDxlN8cOUuV', '786a2bf42c46008ec6c302e32079dc86770dc201ae802b0ec46f081fd23c9e505e3c02d4abcb69a18be577a2faab41dcb34545cf9bcc849317856ae2b4fb0b9c', 'd@example.com', '2009-07-30 23:46:53')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

UPDATE "users" SET "persistence_token" = '5d5b94c6570f8e7eef777ddfe3ab80228289a37814e747c8f0f7800ec71d829dda2af7f94fdc1b273b7aed99b1f1ad89f279ebed98019f03804dc3bd38123164', "crypted_password" = 'cce92f2266f8e009e54daca8d8bce03f2a9a526a30be7e16a7fb77bf3489625c4e7c911ad8af49e3e95461f81f0859b386b1cc9d707b242d8dfa8059fe66430d', "updated_at" = '2009-07-31 15:36:56', "password_salt" = 'yqpCfDdG2J9Pk5_JZOjW' WHERE "id" = 1
---
  def update
    @user = current_user

    respond_to do |format|
      if @user.update_attributes(params[:user])